tutorials/multiphase/reactingTwoPhaseEulerFoam/RAS/wallBoiling/0/alphat.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "5";
    object      alphat.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   nonuniform List<scalar>
1875
(
0.0439193299
0.0997894082
0.13478747
0.154497593
0.159263326
0.150362782
0.12925455
0.0972002875
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar>
25
(
0.0439194645
0.099792728
0.134796701
0.154515
0.159290719
0.150401594
0.129305668
0.0972634083
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar>
25
(
0.0439306217
0.0998668369
0.134985267
0.154854888
0.159810904
0.151128033
0.130261039
0.0984638351
...
)
;
    }
    wall1
    {
        type            compressible::alphatPhaseChangeJayatillekeWallFunction;
        Prt             0.85;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;

        value           nonuniform List<scalar>
75
(
0.00506074943
0.00506075362
0.00506075851
0.00506076381
0.00506076963
0.00506077603
0.00506078309
0.00506079083
...
)
;
    }
    wall2
    {
        type            compressible::alphatWallBoilingWallFunction;
        Prt             0.85;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        relax       0.001;
        dmdt            uniform 0;
        value           uniform 0.01;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
